src/test/jmeter/new.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <org.apache.jorphan.collections.HashTree>
    <java.lang.String>HTTPSamplerProxy</java.lang.String>
    <org.apache.jorphan.collections.HashTree>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Http Sampler">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">reqres.in</stringProp>
        <stringProp name="HTTPSampler.path">/api/users?page=2</stringProp>
        <stringProp name="HTTPSampler.method">GET</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
      </HTTPSamplerProxy>
      <org.apache.jorphan.collections.HashTree/>
    </org.apache.jorphan.collections.HashTree>
    <java.lang.String>TestPlan</java.lang.String>
    <org.apache.jorphan.collections.HashTree>
      <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Simple HTTP Test Run using Java API">
        <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
      </TestPlan>
      <org.apache.jorphan.collections.HashTree/>
    </org.apache.jorphan.collections.HashTree>
    <java.lang.String>loopController</java.lang.String>
    <org.apache.jorphan.collections.HashTree>
      <LoopController guiclass="LoopControlPanel" testclass="LoopController">
        <boolProp name="LoopController.continue_forever">false</boolProp>
        <intProp name="LoopController.loops">2</intProp>
      </LoopController>
      <org.apache.jorphan.collections.HashTree/>
    </org.apache.jorphan.collections.HashTree>
    <java.lang.String>ThreadGroup</java.lang.String>
    <org.apache.jorphan.collections.HashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp reference="../../../../org.apache.jorphan.collections.HashTree[3]/LoopController/boolProp"/>
          <intProp reference="../../../../org.apache.jorphan.collections.HashTree[3]/LoopController/intProp"/>
        </elementProp>
      </ThreadGroup>
      <org.apache.jorphan.collections.HashTree/>
    </org.apache.jorphan.collections.HashTree>
  </org.apache.jorphan.collections.HashTree>
</jmeterTestPlan>